Ran Plan for dir: `poc/dev/shared` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.fulfillment_service_account.google_service_account.service_accounts[0] will be created
  + resource "google_service_account" "service_accounts" {
      + account_id   = "**********************"
      + display_name = "Terraform-managed service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "ccai-df-mva-lab1"
      + unique_id    = (known after apply)
    }

  # module.project_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/cloudbuild.builds.builder--serviceAccount:258624793519@cloudbuild.gserviceaccount.com"] will be created
  + resource "google_project_iam_member" "project_iam_additive" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:258624793519@cloudbuild.gserviceaccount.com"
      + project = "ccai-df-mva-lab1"
      + role    = "roles/cloudbuild.builds.builder"
    }

  # module.project_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/iam.serviceAccountUser--serviceAccount:258624793519@cloudbuild.gserviceaccount.com"] will be created
  + resource "google_project_iam_member" "project_iam_additive" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:258624793519@cloudbuild.gserviceaccount.com"
      + project = "ccai-df-mva-lab1"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.project_iam_bindings.google_project_iam_member.project_iam_additive["default--roles/run.admin--serviceAccount:258624793519@cloudbuild.gserviceaccount.com"] will be created
  + resource "google_project_iam_member" "project_iam_additive" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:258624793519@cloudbuild.gserviceaccount.com"
      + project = "ccai-df-mva-lab1"
      + role    = "roles/run.admin"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d poc/dev/shared`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.193.191.10:4141/lock?id=tandonc%252Fterraform-google-ccai%252Fpoc%252Fdev%252Fshared%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d poc/dev/shared`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
